# CreateLayerLevelType

## Description
Creates a Layer Level Type.  A Layer can be assigned a Layer Level Type, which defines its location within a Story.

```pascal
FUNCTION CreateLayerLevelType(name : STRING) : BOOLEAN;
```

```python

def vs.CreateLayerLevelType(name):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|The name of the Layer Level Type to create.|

## Returns
Whether a Layer Level Type was successfully created.

## See Also
VS Functions:
GetNumLayerLevelTypes| GetLayerLevelType| SetLayerLevelType

## Version
Availability: from Vectorworks 2012
## Category
* Layers